##### 제어문 (실습 테스트)
# 
# 1. 다음 코드 중 실행 결과가 다른 것을 고르시오
#   1) x = 3
#      y = 8
# 
#      if x>5:
#         if y>7:
#            print(x*y)
#      else:
#         print(x+y)
#   
#   2) x = 5
#      y = 6
# 
#      if x>6:
#         if y>2:
#            print(x*y)
#      else:
#         print(x+y)
# 
#   3) x = 5
#      y = 2
# 
#      if x>3:
#         if y>1:
#            print(x*y)
#      else:
#         print(x+y) 
#
# 2. 다음 중첩 조건문에 논리 연산자를 적용해 하나의 if 조건문으로 만들어보시오 
#    
#    x = 38
#    if x>38:
#        if x<50: 
#           print("correct answer")
#
# 3. 점수를 입력 받고 60점 이상이면 통과, 60점 미만이면 과락임을 출력하시오
#    score = in(input("점수를 입력하세요: "))
#    으로 시작하면 된다.
#
# 4. 나이와 키라는 변수가 주어졌을 때 10세 이상이고, 키 120 이상인 경우에만 놀이기구를  
#    탈 수 있다는 조건문을 작성하시오
#    나이 = 12
#    키   = 130  으로 코드 작성을 시작한다.
#
# 5. 여러 개의 조건들을 각각 섬사하고 판단하고자 한다.
#    x = 10
#    y = 12
#    x가 y보다 큰 경우와 작은 경우, 같은 경우를 if, else, elif 문을 사용하여 코드를 작성하라.
#
# 6. numbers라는 리스트형 변수 내에 [6,12,8,10,7,2,3]가 있다. 
#    for문과 continue 키워드를 활용하여 number가 10보다 작으면 다음 반복으로넘어가도록 코드를 작성해 보시오
#
# 7. for문으로 1에서 10까지 출력하되 3의 배수는 건더뛰는 예제를 작성해 보시오
#
# 8. for 반복문과 range() 함수를 조합해서 다음과 같은 결과값이 출력되게 코드를 작성해 보시오
#
#   0번째 반복문입니다.
#   1번째 반복문입니다.
#   2번째 반복문입니다. 
#   3번째 반복문입니다. 
#   4번째 반복문입니다. 
#   5번째 반복문입니다. 
# 
# 9. while 문을 사용하여 1에서 100까지의 모든 4의 배수들의 합을 계산해 보시오
# 
# 10. 1부터 10까지 합계를 구하는 프로그램을 만들고자 한다. 
#    - for와 range 함수를 활용하여 코드를 작성해 보라.
#    - while 문을 활용하여 코드를 작성해 보라.
# 
# 11. while 문을 이용하여 아래와 같이 *을 표시하는 프로그램을 작성해 보시오
# 
#     *******
#      *****
#       ***
#        *
