#### 지도와 데이터 실습
# 1. 지도 서비스의 중요성
#   - 인터넷이 발전하면서 지도 서비스는 현대인의 생활에 없어서는 안 될 중요한 요소가 됨
#   - 내비게이션 서비스를 이용하면 맛집을 안내 받을 수 있고, 실시간 버스 위치도 확인 가능
#   - 데이터 분석 분야에서도 정보를 전달하기 위한 중요 수단으로 지도를 활용
#
# 2. 구글맵 사용을 위한 준비 절차
#   - 1 R을 최신 버전으로 설치
#   - 2 ggplot2를 최신 버전으로 업데이트
#   -3 ggmap 패키지를 설치
#   - 4 구글맵을 사용하기 위한 API 키 확보
#
# 2.1 최신 버전으로 R 설치하기
#   - R을 최신 버전으로 새로 설치하는 이유는 지도 서비스 관련 패키지들이 계속해서 새 버전을 
#     내고 있어 이전 버전의 R에서는 작동이 안되는 경우가 많음
#   - R을 새로 설치한 다음 R Studio에 새로운 버전을 등록시켜주어야 함
#   - Tools - Global Options - Options
#
# 2.2 ggplot2 패키지 업데이트 
#   - 구글 맵상에 데이터를 표현할 때, ggplot2 패키지를 이용하기 때문에 ggplot2 패키지도 최선 버전으로 업데이트
#
# 2.3 ggmap 패키지 설치
#   
# 2.4 구글맵 사용을 위한 API 키 얻기
#   - 구글맵을 사용하기 위해서는 사요앚 프로그램과 구글을 연결하는데 사용되는 API 키가 필요
#   - API 키를 얻으려면 구글 계정이 있어야 함
#   - 먼저 구글 계정으로 로그인 한 후 다음 과정을 따름


