##### 텍스트마이닝 
# 2.인터넷 검색어 분석
#  - 인터넷 검색어 중심으로 사용자들의 관심사를 분석할 수 있도록 지원해주는 많은 사이트들이 있음
#  - 네이버 데이터랩과 구글 트랜드가 대표적
#  - 네이버 데이터랩에서는 주로 국내의 관심사를 알아볼 수 있고, 구글 트랜드에서는 전 세계적인 관심사를 확인
# 
# 3. 공공 빅데이터
# 3.1 공공 데이터 포탈
#   - 가장 풍부한 공공데이터를 제공하는 사이트
#   - 엑셀 형식의 파일을 직접 다운로드하는 방식과 컴퓨터 프로그램 안에서 
#      API를 이용해 가져오는 방식으로 데이터 제공
#   
# 3.2 기상청 날씨누리
#   - 최근 미세먼지와 날씨에 대한 관심이 높아지고 있음
#   - 기상청에서는 기상 관련 데이터를 공개하며, 다운로드도 가능
#   - 기상 예보, 태풍, 황사, 위성, 레이더 등 25종 자료를 쉽게 이용
#   - 현재 기상 자료를 실시간으로 얻을 수 있기 때문에 기상 관련 앱을 개발할 때 이용 가능
#
# 3.3 국가 통계 포털
#   - 국내외 주요 통계를 한 곳에 모아 이용자가 원하는 통계를 한 번에 찾을 수 있도록 통계청이 
#     제공하는 원스톰(One-Stop) 통계 서비스 웹사이트
#   - 현재 300여개 기관이 작성하는 경제, 사회, 환경에 관한 1,000여 종의 국가 승인 통계를 수록
#   - 국제 금융과 경제에 관한 국제 통화기금(IMF), 월드뱅크(WorldBank), 경제협력개발기구(OECD) 드으이 최신 통계도 제공
#   - 편리한 검색 기능과 일반인들도 쉽게 이해할 수 있는 다양한 콘텐츠 및 통계 설명 자료 서비스를 제공

